Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/bootloader/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/flexcom.h
/*
 * Component description for FLEXCOM
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-12-19T08:59:38Z */
#ifndef _PIC32CXMTSH_FLEXCOM_COMPONENT_H_
#define _PIC32CXMTSH_FLEXCOM_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR FLEXCOM                                      */
/* ************************************************************************** */

/* -------- FLEX_MR : (FLEXCOM Offset: 0x00) (R/W 32) FLEXCOM Mode Register -------- */
#define FLEX_MR_OPMODE_Pos                    _UINT32_(0)                                          /* (FLEX_MR) FLEXCOM Operating Mode Position */
#define FLEX_MR_OPMODE_Msk                    (_UINT32_(0x3) << FLEX_MR_OPMODE_Pos)                /* (FLEX_MR) FLEXCOM Operating Mode Mask */
#define FLEX_MR_OPMODE(value)                 (FLEX_MR_OPMODE_Msk & (_UINT32_(value) << FLEX_MR_OPMODE_Pos)) /* Assigment of value for OPMODE in the FLEX_MR register */
#define   FLEX_MR_OPMODE_NO_COM_Val           _UINT32_(0x0)                                        /* (FLEX_MR) No communication  */
#define   FLEX_MR_OPMODE_USART_Val            _UINT32_(0x1)                                        /* (FLEX_MR) All UART related protocols are selected (RS232, RS485, IrDA, ISO7816, LIN,) SPI/TWI related registers are not accessible and have no impact on IOs.  */
#define   FLEX_MR_OPMODE_SPI_Val              _UINT32_(0x2)                                        /* (FLEX_MR) SPI operating mode is selected. USART/TWI related registers are not accessible and have no impact on IOs.  */
#define   FLEX_MR_OPMODE_TWI_Val              _UINT32_(0x3)                                        /* (FLEX_MR) All TWI related protocols are selected (TWI, SMBus). USART/SPI related registers are not accessible and have no impact on IOs.  */
#define FLEX_MR_OPMODE_NO_COM                 (FLEX_MR_OPMODE_NO_COM_Val << FLEX_MR_OPMODE_Pos)    /* (FLEX_MR) No communication Position  */
#define FLEX_MR_OPMODE_USART                  (FLEX_MR_OPMODE_USART_Val << FLEX_MR_OPMODE_Pos)     /* (FLEX_MR) All UART related protocols are selected (RS232, RS485, IrDA, ISO7816, LIN,) SPI/TWI related registers are not accessible and have no impact on IOs. Position  */
#define FLEX_MR_OPMODE_SPI                    (FLEX_MR_OPMODE_SPI_Val << FLEX_MR_OPMODE_Pos)       /* (FLEX_MR) SPI operating mode is selected. USART/TWI related registers are not accessible and have no impact on IOs. Position  */
#define FLEX_MR_OPMODE_TWI                    (FLEX_MR_OPMODE_TWI_Val << FLEX_MR_OPMODE_Pos)       /* (FLEX_MR) All TWI related protocols are selected (TWI, SMBus). USART/SPI related registers are not accessible and have no impact on IOs. Position  */
#define FLEX_MR_Msk                           _UINT32_(0x00000003)                                 /* (FLEX_MR) Register Mask  */


/* -------- FLEX_RHR : (FLEXCOM Offset: 0x10) ( R/ 32) FLEXCOM Receive Holding Register -------- */
#define FLEX_RHR_RXDATA_Pos                   _UINT32_(0)                                          /* (FLEX_RHR) Receive Data Position */
#define FLEX_RHR_RXDATA_Msk                   (_UINT32_(0xFFFF) << FLEX_RHR_RXDATA_Pos)            /* (FLEX_RHR) Receive Data Mask */
#define FLEX_RHR_RXDATA(value)                (FLEX_RHR_RXDATA_Msk & (_UINT32_(value) << FLEX_RHR_RXDATA_Pos)) /* Assigment of value for RXDATA in the FLEX_RHR register */
#define FLEX_RHR_Msk                          _UINT32_(0x0000FFFF)                                 /* (FLEX_RHR) Register Mask  */


/* -------- FLEX_THR : (FLEXCOM Offset: 0x20) (R/W 32) FLEXCOM Transmit Holding Register -------- */
#define FLEX_THR_TXDATA_Pos                   _UINT32_(0)                                          /* (FLEX_THR) Transmit Data Position */
#define FLEX_THR_TXDATA_Msk                   (_UINT32_(0xFFFF) << FLEX_THR_TXDATA_Pos)            /* (FLEX_THR) Transmit Data Mask */
#define FLEX_THR_TXDATA(value)                (FLEX_THR_TXDATA_Msk & (_UINT32_(value) << FLEX_THR_TXDATA_Pos)) /* Assigment of value for TXDATA in the FLEX_THR register */
#define FLEX_THR_Msk                          _UINT32_(0x0000FFFF)                                 /* (FLEX_THR) Register Mask  */


/* -------- FLEX_RPR : (FLEXCOM Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#define FLEX_RPR_RXPTR_Pos                    _UINT32_(0)                                          /* (FLEX_RPR) Receive Pointer Register Position */
#define FLEX_RPR_RXPTR_Msk                    (_UINT32_(0xFFFFFFFF) << FLEX_RPR_RXPTR_Pos)         /* (FLEX_RPR) Receive Pointer Register Mask */
#define FLEX_RPR_RXPTR(value)                 (FLEX_RPR_RXPTR_Msk & (_UINT32_(value) << FLEX_RPR_RXPTR_Pos)) /* Assigment of value for RXPTR in the FLEX_RPR register */
#define FLEX_RPR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (FLEX_RPR) Register Mask  */


/* -------- FLEX_RCR : (FLEXCOM Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#define FLEX_RCR_RXCTR_Pos                    _UINT32_(0)                                          /* (FLEX_RCR) Receive Counter Register Position */
#define FLEX_RCR_RXCTR_Msk                    (_UINT32_(0xFFFF) << FLEX_RCR_RXCTR_Pos)             /* (FLEX_RCR) Receive Counter Register Mask */
#define FLEX_RCR_RXCTR(value)                 (FLEX_RCR_RXCTR_Msk & (_UINT32_(value) << FLEX_RCR_RXCTR_Pos)) /* Assigment of value for RXCTR in the FLEX_RCR register */
#define FLEX_RCR_Msk                          _UINT32_(0x0000FFFF)                                 /* (FLEX_RCR) Register Mask  */


/* -------- FLEX_TPR : (FLEXCOM Offset: 0x108) (R/W 32) Transmit Pointer Register -------- */
#define FLEX_TPR_TXPTR_Pos                    _UINT32_(0)                                          /* (FLEX_TPR) Transmit Counter Register Position */
#define FLEX_TPR_TXPTR_Msk                    (_UINT32_(0xFFFFFFFF) << FLEX_TPR_TXPTR_Pos)         /* (FLEX_TPR) Transmit Counter Register Mask */
#define FLEX_TPR_TXPTR(value)                 (FLEX_TPR_TXPTR_Msk & (_UINT32_(value) << FLEX_TPR_TXPTR_Pos)) /* Assigment of value for TXPTR in the FLEX_TPR register */
#define FLEX_TPR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (FLEX_TPR) Register Mask  */


/* -------- FLEX_TCR : (FLEXCOM Offset: 0x10C) (R/W 32) Transmit Counter Register -------- */
#define FLEX_TCR_TXCTR_Pos                    _UINT32_(0)                                          /* (FLEX_TCR) Transmit Counter Register Position */
#define FLEX_TCR_TXCTR_Msk                    (_UINT32_(0xFFFF) << FLEX_TCR_TXCTR_Pos)             /* (FLEX_TCR) Transmit Counter Register Mask */
#define FLEX_TCR_TXCTR(value)                 (FLEX_TCR_TXCTR_Msk & (_UINT32_(value) << FLEX_TCR_TXCTR_Pos)) /* Assigment of value for TXCTR in the FLEX_TCR register */
#define FLEX_TCR_Msk                          _UINT32_(0x0000FFFF)                                 /* (FLEX_TCR) Register Mask  */


