Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/bootloader/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/flexcom.h
/* -------- FLEX_RNPR : (FLEXCOM Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#define FLEX_RNPR_RXNPTR_Pos                  _UINT32_(0)                                          /* (FLEX_RNPR) Receive Next Pointer Position */
#define FLEX_RNPR_RXNPTR_Msk                  (_UINT32_(0xFFFFFFFF) << FLEX_RNPR_RXNPTR_Pos)       /* (FLEX_RNPR) Receive Next Pointer Mask */
#define FLEX_RNPR_RXNPTR(value)               (FLEX_RNPR_RXNPTR_Msk & (_UINT32_(value) << FLEX_RNPR_RXNPTR_Pos)) /* Assigment of value for RXNPTR in the FLEX_RNPR register */
#define FLEX_RNPR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (FLEX_RNPR) Register Mask  */


/* -------- FLEX_RNCR : (FLEXCOM Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#define FLEX_RNCR_RXNCTR_Pos                  _UINT32_(0)                                          /* (FLEX_RNCR) Receive Next Counter Position */
#define FLEX_RNCR_RXNCTR_Msk                  (_UINT32_(0xFFFF) << FLEX_RNCR_RXNCTR_Pos)           /* (FLEX_RNCR) Receive Next Counter Mask */
#define FLEX_RNCR_RXNCTR(value)               (FLEX_RNCR_RXNCTR_Msk & (_UINT32_(value) << FLEX_RNCR_RXNCTR_Pos)) /* Assigment of value for RXNCTR in the FLEX_RNCR register */
#define FLEX_RNCR_Msk                         _UINT32_(0x0000FFFF)                                 /* (FLEX_RNCR) Register Mask  */


/* -------- FLEX_TNPR : (FLEXCOM Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#define FLEX_TNPR_TXNPTR_Pos                  _UINT32_(0)                                          /* (FLEX_TNPR) Transmit Next Pointer Position */
#define FLEX_TNPR_TXNPTR_Msk                  (_UINT32_(0xFFFFFFFF) << FLEX_TNPR_TXNPTR_Pos)       /* (FLEX_TNPR) Transmit Next Pointer Mask */
#define FLEX_TNPR_TXNPTR(value)               (FLEX_TNPR_TXNPTR_Msk & (_UINT32_(value) << FLEX_TNPR_TXNPTR_Pos)) /* Assigment of value for TXNPTR in the FLEX_TNPR register */
#define FLEX_TNPR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (FLEX_TNPR) Register Mask  */


/* -------- FLEX_TNCR : (FLEXCOM Offset: 0x11C) (R/W 32) Transmit Next Counter Register -------- */
#define FLEX_TNCR_TXNCTR_Pos                  _UINT32_(0)                                          /* (FLEX_TNCR) Transmit Counter Next Position */
#define FLEX_TNCR_TXNCTR_Msk                  (_UINT32_(0xFFFF) << FLEX_TNCR_TXNCTR_Pos)           /* (FLEX_TNCR) Transmit Counter Next Mask */
#define FLEX_TNCR_TXNCTR(value)               (FLEX_TNCR_TXNCTR_Msk & (_UINT32_(value) << FLEX_TNCR_TXNCTR_Pos)) /* Assigment of value for TXNCTR in the FLEX_TNCR register */
#define FLEX_TNCR_Msk                         _UINT32_(0x0000FFFF)                                 /* (FLEX_TNCR) Register Mask  */


/* -------- FLEX_PTCR : (FLEXCOM Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define FLEX_PTCR_RXTEN_Pos                   _UINT32_(0)                                          /* (FLEX_PTCR) Receiver Transfer Enable Position */
#define FLEX_PTCR_RXTEN_Msk                   (_UINT32_(0x1) << FLEX_PTCR_RXTEN_Pos)               /* (FLEX_PTCR) Receiver Transfer Enable Mask */
#define FLEX_PTCR_RXTEN(value)                (FLEX_PTCR_RXTEN_Msk & (_UINT32_(value) << FLEX_PTCR_RXTEN_Pos)) /* Assigment of value for RXTEN in the FLEX_PTCR register */
#define FLEX_PTCR_RXTDIS_Pos                  _UINT32_(1)                                          /* (FLEX_PTCR) Receiver Transfer Disable Position */
#define FLEX_PTCR_RXTDIS_Msk                  (_UINT32_(0x1) << FLEX_PTCR_RXTDIS_Pos)              /* (FLEX_PTCR) Receiver Transfer Disable Mask */
#define FLEX_PTCR_RXTDIS(value)               (FLEX_PTCR_RXTDIS_Msk & (_UINT32_(value) << FLEX_PTCR_RXTDIS_Pos)) /* Assigment of value for RXTDIS in the FLEX_PTCR register */
#define FLEX_PTCR_TXTEN_Pos                   _UINT32_(8)                                          /* (FLEX_PTCR) Transmitter Transfer Enable Position */
#define FLEX_PTCR_TXTEN_Msk                   (_UINT32_(0x1) << FLEX_PTCR_TXTEN_Pos)               /* (FLEX_PTCR) Transmitter Transfer Enable Mask */
#define FLEX_PTCR_TXTEN(value)                (FLEX_PTCR_TXTEN_Msk & (_UINT32_(value) << FLEX_PTCR_TXTEN_Pos)) /* Assigment of value for TXTEN in the FLEX_PTCR register */
#define FLEX_PTCR_TXTDIS_Pos                  _UINT32_(9)                                          /* (FLEX_PTCR) Transmitter Transfer Disable Position */
#define FLEX_PTCR_TXTDIS_Msk                  (_UINT32_(0x1) << FLEX_PTCR_TXTDIS_Pos)              /* (FLEX_PTCR) Transmitter Transfer Disable Mask */
#define FLEX_PTCR_TXTDIS(value)               (FLEX_PTCR_TXTDIS_Msk & (_UINT32_(value) << FLEX_PTCR_TXTDIS_Pos)) /* Assigment of value for TXTDIS in the FLEX_PTCR register */
#define FLEX_PTCR_RXCBEN_Pos                  _UINT32_(16)                                         /* (FLEX_PTCR) Receiver Circular Buffer Enable Position */
#define FLEX_PTCR_RXCBEN_Msk                  (_UINT32_(0x1) << FLEX_PTCR_RXCBEN_Pos)              /* (FLEX_PTCR) Receiver Circular Buffer Enable Mask */
#define FLEX_PTCR_RXCBEN(value)               (FLEX_PTCR_RXCBEN_Msk & (_UINT32_(value) << FLEX_PTCR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the FLEX_PTCR register */
#define FLEX_PTCR_RXCBDIS_Pos                 _UINT32_(17)                                         /* (FLEX_PTCR) Receiver Circular Buffer Disable Position */
#define FLEX_PTCR_RXCBDIS_Msk                 (_UINT32_(0x1) << FLEX_PTCR_RXCBDIS_Pos)             /* (FLEX_PTCR) Receiver Circular Buffer Disable Mask */
#define FLEX_PTCR_RXCBDIS(value)              (FLEX_PTCR_RXCBDIS_Msk & (_UINT32_(value) << FLEX_PTCR_RXCBDIS_Pos)) /* Assigment of value for RXCBDIS in the FLEX_PTCR register */
#define FLEX_PTCR_TXCBEN_Pos                  _UINT32_(18)                                         /* (FLEX_PTCR) Transmitter Circular Buffer Enable Position */
#define FLEX_PTCR_TXCBEN_Msk                  (_UINT32_(0x1) << FLEX_PTCR_TXCBEN_Pos)              /* (FLEX_PTCR) Transmitter Circular Buffer Enable Mask */
#define FLEX_PTCR_TXCBEN(value)               (FLEX_PTCR_TXCBEN_Msk & (_UINT32_(value) << FLEX_PTCR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the FLEX_PTCR register */
#define FLEX_PTCR_TXCBDIS_Pos                 _UINT32_(19)                                         /* (FLEX_PTCR) Transmitter Circular Buffer Disable Position */
#define FLEX_PTCR_TXCBDIS_Msk                 (_UINT32_(0x1) << FLEX_PTCR_TXCBDIS_Pos)             /* (FLEX_PTCR) Transmitter Circular Buffer Disable Mask */
#define FLEX_PTCR_TXCBDIS(value)              (FLEX_PTCR_TXCBDIS_Msk & (_UINT32_(value) << FLEX_PTCR_TXCBDIS_Pos)) /* Assigment of value for TXCBDIS in the FLEX_PTCR register */
#define FLEX_PTCR_ERRCLR_Pos                  _UINT32_(24)                                         /* (FLEX_PTCR) Transfer Bus Error Clear Position */
#define FLEX_PTCR_ERRCLR_Msk                  (_UINT32_(0x1) << FLEX_PTCR_ERRCLR_Pos)              /* (FLEX_PTCR) Transfer Bus Error Clear Mask */
#define FLEX_PTCR_ERRCLR(value)               (FLEX_PTCR_ERRCLR_Msk & (_UINT32_(value) << FLEX_PTCR_ERRCLR_Pos)) /* Assigment of value for ERRCLR in the FLEX_PTCR register */
#define FLEX_PTCR_Msk                         _UINT32_(0x010F0303)                                 /* (FLEX_PTCR) Register Mask  */


/* -------- FLEX_PTSR : (FLEXCOM Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define FLEX_PTSR_RXTEN_Pos                   _UINT32_(0)                                          /* (FLEX_PTSR) Receiver Transfer Enable Position */
#define FLEX_PTSR_RXTEN_Msk                   (_UINT32_(0x1) << FLEX_PTSR_RXTEN_Pos)               /* (FLEX_PTSR) Receiver Transfer Enable Mask */
#define FLEX_PTSR_RXTEN(value)                (FLEX_PTSR_RXTEN_Msk & (_UINT32_(value) << FLEX_PTSR_RXTEN_Pos)) /* Assigment of value for RXTEN in the FLEX_PTSR register */
#define FLEX_PTSR_TXTEN_Pos                   _UINT32_(8)                                          /* (FLEX_PTSR) Transmitter Transfer Enable Position */
#define FLEX_PTSR_TXTEN_Msk                   (_UINT32_(0x1) << FLEX_PTSR_TXTEN_Pos)               /* (FLEX_PTSR) Transmitter Transfer Enable Mask */
#define FLEX_PTSR_TXTEN(value)                (FLEX_PTSR_TXTEN_Msk & (_UINT32_(value) << FLEX_PTSR_TXTEN_Pos)) /* Assigment of value for TXTEN in the FLEX_PTSR register */
#define FLEX_PTSR_RXCBEN_Pos                  _UINT32_(16)                                         /* (FLEX_PTSR) Receiver Circular Buffer Enable Position */
#define FLEX_PTSR_RXCBEN_Msk                  (_UINT32_(0x1) << FLEX_PTSR_RXCBEN_Pos)              /* (FLEX_PTSR) Receiver Circular Buffer Enable Mask */
#define FLEX_PTSR_RXCBEN(value)               (FLEX_PTSR_RXCBEN_Msk & (_UINT32_(value) << FLEX_PTSR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the FLEX_PTSR register */
#define FLEX_PTSR_TXCBEN_Pos                  _UINT32_(18)                                         /* (FLEX_PTSR) Transmitter Circular Buffer Enable Position */
#define FLEX_PTSR_TXCBEN_Msk                  (_UINT32_(0x1) << FLEX_PTSR_TXCBEN_Pos)              /* (FLEX_PTSR) Transmitter Circular Buffer Enable Mask */
#define FLEX_PTSR_TXCBEN(value)               (FLEX_PTSR_TXCBEN_Msk & (_UINT32_(value) << FLEX_PTSR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the FLEX_PTSR register */
#define FLEX_PTSR_ERR_Pos                     _UINT32_(24)                                         /* (FLEX_PTSR) Transfer Bus Error Position */
#define FLEX_PTSR_ERR_Msk                     (_UINT32_(0x1) << FLEX_PTSR_ERR_Pos)                 /* (FLEX_PTSR) Transfer Bus Error Mask */
#define FLEX_PTSR_ERR(value)                  (FLEX_PTSR_ERR_Msk & (_UINT32_(value) << FLEX_PTSR_ERR_Pos)) /* Assigment of value for ERR in the FLEX_PTSR register */
#define FLEX_PTSR_Msk                         _UINT32_(0x01050101)                                 /* (FLEX_PTSR) Register Mask  */


/* -------- FLEX_PWPMR : (FLEXCOM Offset: 0x128) (R/W 32) Write Protection Mode Register -------- */
#define FLEX_PWPMR_WPPTREN_Pos                _UINT32_(0)                                          /* (FLEX_PWPMR) Write Protection Pointer Registers Enable Position */
#define FLEX_PWPMR_WPPTREN_Msk                (_UINT32_(0x1) << FLEX_PWPMR_WPPTREN_Pos)            /* (FLEX_PWPMR) Write Protection Pointer Registers Enable Mask */
#define FLEX_PWPMR_WPPTREN(value)             (FLEX_PWPMR_WPPTREN_Msk & (_UINT32_(value) << FLEX_PWPMR_WPPTREN_Pos)) /* Assigment of value for WPPTREN in the FLEX_PWPMR register */
#define FLEX_PWPMR_WPCTREN_Pos                _UINT32_(1)                                          /* (FLEX_PWPMR) Write Protection Counter Registers Enable Position */
#define FLEX_PWPMR_WPCTREN_Msk                (_UINT32_(0x1) << FLEX_PWPMR_WPCTREN_Pos)            /* (FLEX_PWPMR) Write Protection Counter Registers Enable Mask */
#define FLEX_PWPMR_WPCTREN(value)             (FLEX_PWPMR_WPCTREN_Msk & (_UINT32_(value) << FLEX_PWPMR_WPCTREN_Pos)) /* Assigment of value for WPCTREN in the FLEX_PWPMR register */
#define FLEX_PWPMR_WPCREN_Pos                 _UINT32_(2)                                          /* (FLEX_PWPMR) Write Protection Control Register Enable Position */
#define FLEX_PWPMR_WPCREN_Msk                 (_UINT32_(0x1) << FLEX_PWPMR_WPCREN_Pos)             /* (FLEX_PWPMR) Write Protection Control Register Enable Mask */
#define FLEX_PWPMR_WPCREN(value)              (FLEX_PWPMR_WPCREN_Msk & (_UINT32_(value) << FLEX_PWPMR_WPCREN_Pos)) /* Assigment of value for WPCREN in the FLEX_PWPMR register */
#define FLEX_PWPMR_WPKEY_Pos                  _UINT32_(8)                                          /* (FLEX_PWPMR) Write Protection Key Position */
#define FLEX_PWPMR_WPKEY_Msk                  (_UINT32_(0xFFFFFF) << FLEX_PWPMR_WPKEY_Pos)         /* (FLEX_PWPMR) Write Protection Key Mask */
#define FLEX_PWPMR_WPKEY(value)               (FLEX_PWPMR_WPKEY_Msk & (_UINT32_(value) << FLEX_PWPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the FLEX_PWPMR register */
#define   FLEX_PWPMR_WPKEY_PASSWD_Val         _UINT32_(0x504443)                                   /* (FLEX_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0.  */
#define FLEX_PWPMR_WPKEY_PASSWD               (FLEX_PWPMR_WPKEY_PASSWD_Val << FLEX_PWPMR_WPKEY_Pos) /* (FLEX_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. Position  */
#define FLEX_PWPMR_Msk                        _UINT32_(0xFFFFFF07)                                 /* (FLEX_PWPMR) Register Mask  */


