Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/bootloader/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/flexcom.h
/* OOK mode */
#define FLEX_US_MR_OOK_USART_MODE_Pos         _UINT32_(0)                                          /* (FLEX_US_MR) USART Mode of Operation Position */
#define FLEX_US_MR_OOK_USART_MODE_Msk         (_UINT32_(0xF) << FLEX_US_MR_OOK_USART_MODE_Pos)     /* (FLEX_US_MR) USART Mode of Operation Mask */
#define FLEX_US_MR_OOK_USART_MODE(value)      (FLEX_US_MR_OOK_USART_MODE_Msk & (_UINT32_(value) << FLEX_US_MR_OOK_USART_MODE_Pos))
#define   FLEX_US_MR_OOK_USART_MODE_NORMAL_Val _UINT32_(0x0)                                        /* (FLEX_US_MR) Normal mode  */
#define FLEX_US_MR_OOK_USART_MODE_NORMAL      (FLEX_US_MR_OOK_USART_MODE_NORMAL_Val << FLEX_US_MR_OOK_USART_MODE_Pos) /* (FLEX_US_MR) Normal mode Position  */
#define FLEX_US_MR_OOK_USCLKS_Pos             _UINT32_(4)                                          /* (FLEX_US_MR) Clock Selection Position */
#define FLEX_US_MR_OOK_USCLKS_Msk             (_UINT32_(0x3) << FLEX_US_MR_OOK_USCLKS_Pos)         /* (FLEX_US_MR) Clock Selection Mask */
#define FLEX_US_MR_OOK_USCLKS(value)          (FLEX_US_MR_OOK_USCLKS_Msk & (_UINT32_(value) << FLEX_US_MR_OOK_USCLKS_Pos))
#define   FLEX_US_MR_OOK_USCLKS_MCK_Val       _UINT32_(0x0)                                        /* (FLEX_US_MR) Peripheral clock is selected.  */
#define   FLEX_US_MR_OOK_USCLKS_DIV_Val       _UINT32_(0x1)                                        /* (FLEX_US_MR) Peripheral clock divided (DIV=8) is selected.  */
#define   FLEX_US_MR_OOK_USCLKS_PCK_Val       _UINT32_(0x2)                                        /* (FLEX_US_MR) PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1.  */
#define   FLEX_US_MR_OOK_USCLKS_SCK_Val       _UINT32_(0x3)                                        /* (FLEX_US_MR) Serial clock (SCK) is selected.  */
#define FLEX_US_MR_OOK_USCLKS_MCK             (FLEX_US_MR_OOK_USCLKS_MCK_Val << FLEX_US_MR_OOK_USCLKS_Pos) /* (FLEX_US_MR) Peripheral clock is selected. Position  */
#define FLEX_US_MR_OOK_USCLKS_DIV             (FLEX_US_MR_OOK_USCLKS_DIV_Val << FLEX_US_MR_OOK_USCLKS_Pos) /* (FLEX_US_MR) Peripheral clock divided (DIV=8) is selected. Position  */
#define FLEX_US_MR_OOK_USCLKS_PCK             (FLEX_US_MR_OOK_USCLKS_PCK_Val << FLEX_US_MR_OOK_USCLKS_Pos) /* (FLEX_US_MR) PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1. Position  */
#define FLEX_US_MR_OOK_USCLKS_SCK             (FLEX_US_MR_OOK_USCLKS_SCK_Val << FLEX_US_MR_OOK_USCLKS_Pos) /* (FLEX_US_MR) Serial clock (SCK) is selected. Position  */
#define FLEX_US_MR_OOK_CHRL_Pos               _UINT32_(6)                                          /* (FLEX_US_MR) Character Length Position */
#define FLEX_US_MR_OOK_CHRL_Msk               (_UINT32_(0x3) << FLEX_US_MR_OOK_CHRL_Pos)           /* (FLEX_US_MR) Character Length Mask */
#define FLEX_US_MR_OOK_CHRL(value)            (FLEX_US_MR_OOK_CHRL_Msk & (_UINT32_(value) << FLEX_US_MR_OOK_CHRL_Pos))
#define   FLEX_US_MR_OOK_CHRL_5_BIT_Val       _UINT32_(0x0)                                        /* (FLEX_US_MR) Character length is 5 bits.  */
#define   FLEX_US_MR_OOK_CHRL_6_BIT_Val       _UINT32_(0x1)                                        /* (FLEX_US_MR) Character length is 6 bits.  */
#define   FLEX_US_MR_OOK_CHRL_7_BIT_Val       _UINT32_(0x2)                                        /* (FLEX_US_MR) Character length is 7 bits.  */
#define   FLEX_US_MR_OOK_CHRL_8_BIT_Val       _UINT32_(0x3)                                        /* (FLEX_US_MR) Character length is 8 bits.  */
#define FLEX_US_MR_OOK_CHRL_5_BIT             (FLEX_US_MR_OOK_CHRL_5_BIT_Val << FLEX_US_MR_OOK_CHRL_Pos) /* (FLEX_US_MR) Character length is 5 bits. Position  */
#define FLEX_US_MR_OOK_CHRL_6_BIT             (FLEX_US_MR_OOK_CHRL_6_BIT_Val << FLEX_US_MR_OOK_CHRL_Pos) /* (FLEX_US_MR) Character length is 6 bits. Position  */
#define FLEX_US_MR_OOK_CHRL_7_BIT             (FLEX_US_MR_OOK_CHRL_7_BIT_Val << FLEX_US_MR_OOK_CHRL_Pos) /* (FLEX_US_MR) Character length is 7 bits. Position  */
#define FLEX_US_MR_OOK_CHRL_8_BIT             (FLEX_US_MR_OOK_CHRL_8_BIT_Val << FLEX_US_MR_OOK_CHRL_Pos) /* (FLEX_US_MR) Character length is 8 bits. Position  */
#define FLEX_US_MR_OOK_SYNC_Pos               _UINT32_(8)                                          /* (FLEX_US_MR) Synchronous Mode Select Position */
#define FLEX_US_MR_OOK_SYNC_Msk               (_UINT32_(0x1) << FLEX_US_MR_OOK_SYNC_Pos)           /* (FLEX_US_MR) Synchronous Mode Select Mask */
#define FLEX_US_MR_OOK_SYNC(value)            (FLEX_US_MR_OOK_SYNC_Msk & (_UINT32_(value) << FLEX_US_MR_OOK_SYNC_Pos))
#define FLEX_US_MR_OOK_PAR_Pos                _UINT32_(9)                                          /* (FLEX_US_MR) Parity Type Position */
#define FLEX_US_MR_OOK_PAR_Msk                (_UINT32_(0x7) << FLEX_US_MR_OOK_PAR_Pos)            /* (FLEX_US_MR) Parity Type Mask */
#define FLEX_US_MR_OOK_PAR(value)             (FLEX_US_MR_OOK_PAR_Msk & (_UINT32_(value) << FLEX_US_MR_OOK_PAR_Pos))
#define   FLEX_US_MR_OOK_PAR_EVEN_Val         _UINT32_(0x0)                                        /* (FLEX_US_MR) Even parity  */
#define   FLEX_US_MR_OOK_PAR_ODD_Val          _UINT32_(0x1)                                        /* (FLEX_US_MR) Odd parity  */
#define   FLEX_US_MR_OOK_PAR_SPACE_Val        _UINT32_(0x2)                                        /* (FLEX_US_MR) Parity forced to 0 (Space)  */
#define   FLEX_US_MR_OOK_PAR_MARK_Val         _UINT32_(0x3)                                        /* (FLEX_US_MR) Parity forced to 1 (Mark)  */
#define   FLEX_US_MR_OOK_PAR_NO_Val           _UINT32_(0x4)                                        /* (FLEX_US_MR) No parity  */
#define   FLEX_US_MR_OOK_PAR_MULTIDROP_Val    _UINT32_(0x6)                                        /* (FLEX_US_MR) Multidrop mode  */
#define FLEX_US_MR_OOK_PAR_EVEN               (FLEX_US_MR_OOK_PAR_EVEN_Val << FLEX_US_MR_OOK_PAR_Pos) /* (FLEX_US_MR) Even parity Position  */
#define FLEX_US_MR_OOK_PAR_ODD                (FLEX_US_MR_OOK_PAR_ODD_Val << FLEX_US_MR_OOK_PAR_Pos) /* (FLEX_US_MR) Odd parity Position  */
#define FLEX_US_MR_OOK_PAR_SPACE              (FLEX_US_MR_OOK_PAR_SPACE_Val << FLEX_US_MR_OOK_PAR_Pos) /* (FLEX_US_MR) Parity forced to 0 (Space) Position  */
#define FLEX_US_MR_OOK_PAR_MARK               (FLEX_US_MR_OOK_PAR_MARK_Val << FLEX_US_MR_OOK_PAR_Pos) /* (FLEX_US_MR) Parity forced to 1 (Mark) Position  */
#define FLEX_US_MR_OOK_PAR_NO                 (FLEX_US_MR_OOK_PAR_NO_Val << FLEX_US_MR_OOK_PAR_Pos) /* (FLEX_US_MR) No parity Position  */
#define FLEX_US_MR_OOK_PAR_MULTIDROP          (FLEX_US_MR_OOK_PAR_MULTIDROP_Val << FLEX_US_MR_OOK_PAR_Pos) /* (FLEX_US_MR) Multidrop mode Position  */
#define FLEX_US_MR_OOK_NBSTOP_Pos             _UINT32_(12)                                         /* (FLEX_US_MR) Number of Stop Bits Position */
#define FLEX_US_MR_OOK_NBSTOP_Msk             (_UINT32_(0x3) << FLEX_US_MR_OOK_NBSTOP_Pos)         /* (FLEX_US_MR) Number of Stop Bits Mask */
#define FLEX_US_MR_OOK_NBSTOP(value)          (FLEX_US_MR_OOK_NBSTOP_Msk & (_UINT32_(value) << FLEX_US_MR_OOK_NBSTOP_Pos))
#define   FLEX_US_MR_OOK_NBSTOP_1_BIT_Val     _UINT32_(0x0)                                        /* (FLEX_US_MR) 1 stop bit  */
#define   FLEX_US_MR_OOK_NBSTOP_1_5_BIT_Val   _UINT32_(0x1)                                        /* (FLEX_US_MR) 1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)  */
#define   FLEX_US_MR_OOK_NBSTOP_2_BIT_Val     _UINT32_(0x2)                                        /* (FLEX_US_MR) 2 stop bits  */
#define FLEX_US_MR_OOK_NBSTOP_1_BIT           (FLEX_US_MR_OOK_NBSTOP_1_BIT_Val << FLEX_US_MR_OOK_NBSTOP_Pos) /* (FLEX_US_MR) 1 stop bit Position  */
#define FLEX_US_MR_OOK_NBSTOP_1_5_BIT         (FLEX_US_MR_OOK_NBSTOP_1_5_BIT_Val << FLEX_US_MR_OOK_NBSTOP_Pos) /* (FLEX_US_MR) 1.5 stop bit (SYNC = 0) or reserved (SYNC = 1) Position  */
#define FLEX_US_MR_OOK_NBSTOP_2_BIT           (FLEX_US_MR_OOK_NBSTOP_2_BIT_Val << FLEX_US_MR_OOK_NBSTOP_Pos) /* (FLEX_US_MR) 2 stop bits Position  */
#define FLEX_US_MR_OOK_CHMODE_Pos             _UINT32_(14)                                         /* (FLEX_US_MR) Channel Mode Position */
#define FLEX_US_MR_OOK_CHMODE_Msk             (_UINT32_(0x3) << FLEX_US_MR_OOK_CHMODE_Pos)         /* (FLEX_US_MR) Channel Mode Mask */
#define FLEX_US_MR_OOK_CHMODE(value)          (FLEX_US_MR_OOK_CHMODE_Msk & (_UINT32_(value) << FLEX_US_MR_OOK_CHMODE_Pos))
#define   FLEX_US_MR_OOK_CHMODE_NORMAL_Val    _UINT32_(0x0)                                        /* (FLEX_US_MR) Normal mode  */
#define   FLEX_US_MR_OOK_CHMODE_AUTOMATIC_Val _UINT32_(0x1)                                        /* (FLEX_US_MR) Automatic Echo. Receiver input is connected to the TXD pin.  */
#define   FLEX_US_MR_OOK_CHMODE_LOCAL_LOOPBACK_Val _UINT32_(0x2)                                        /* (FLEX_US_MR) Local Loopback. Transmitter output is connected to the Receiver Input.  */
#define   FLEX_US_MR_OOK_CHMODE_REMOTE_LOOPBACK_Val _UINT32_(0x3)                                        /* (FLEX_US_MR) Remote Loopback. RXD pin is internally connected to the TXD pin.  */
#define FLEX_US_MR_OOK_CHMODE_NORMAL          (FLEX_US_MR_OOK_CHMODE_NORMAL_Val << FLEX_US_MR_OOK_CHMODE_Pos) /* (FLEX_US_MR) Normal mode Position  */
#define FLEX_US_MR_OOK_CHMODE_AUTOMATIC       (FLEX_US_MR_OOK_CHMODE_AUTOMATIC_Val << FLEX_US_MR_OOK_CHMODE_Pos) /* (FLEX_US_MR) Automatic Echo. Receiver input is connected to the TXD pin. Position  */
#define FLEX_US_MR_OOK_CHMODE_LOCAL_LOOPBACK  (FLEX_US_MR_OOK_CHMODE_LOCAL_LOOPBACK_Val << FLEX_US_MR_OOK_CHMODE_Pos) /* (FLEX_US_MR) Local Loopback. Transmitter output is connected to the Receiver Input. Position  */
#define FLEX_US_MR_OOK_CHMODE_REMOTE_LOOPBACK (FLEX_US_MR_OOK_CHMODE_REMOTE_LOOPBACK_Val << FLEX_US_MR_OOK_CHMODE_Pos) /* (FLEX_US_MR) Remote Loopback. RXD pin is internally connected to the TXD pin. Position  */
#define FLEX_US_MR_OOK_MSBF_Pos               _UINT32_(16)                                         /* (FLEX_US_MR) Bit Order Position */
#define FLEX_US_MR_OOK_MSBF_Msk               (_UINT32_(0x1) << FLEX_US_MR_OOK_MSBF_Pos)           /* (FLEX_US_MR) Bit Order Mask */
#define FLEX_US_MR_OOK_MSBF(value)            (FLEX_US_MR_OOK_MSBF_Msk & (_UINT32_(value) << FLEX_US_MR_OOK_MSBF_Pos))
#define FLEX_US_MR_OOK_MODE9_Pos              _UINT32_(17)                                         /* (FLEX_US_MR) 9-bit Character Length Position */
#define FLEX_US_MR_OOK_MODE9_Msk              (_UINT32_(0x1) << FLEX_US_MR_OOK_MODE9_Pos)          /* (FLEX_US_MR) 9-bit Character Length Mask */
#define FLEX_US_MR_OOK_MODE9(value)           (FLEX_US_MR_OOK_MODE9_Msk & (_UINT32_(value) << FLEX_US_MR_OOK_MODE9_Pos))
#define FLEX_US_MR_OOK_CLKO_Pos               _UINT32_(18)                                         /* (FLEX_US_MR) Clock Output Select Position */
#define FLEX_US_MR_OOK_CLKO_Msk               (_UINT32_(0x1) << FLEX_US_MR_OOK_CLKO_Pos)           /* (FLEX_US_MR) Clock Output Select Mask */
#define FLEX_US_MR_OOK_CLKO(value)            (FLEX_US_MR_OOK_CLKO_Msk & (_UINT32_(value) << FLEX_US_MR_OOK_CLKO_Pos))
#define FLEX_US_MR_OOK_OVER_Pos               _UINT32_(19)                                         /* (FLEX_US_MR) Oversampling Mode Position */
#define FLEX_US_MR_OOK_OVER_Msk               (_UINT32_(0x1) << FLEX_US_MR_OOK_OVER_Pos)           /* (FLEX_US_MR) Oversampling Mode Mask */
#define FLEX_US_MR_OOK_OVER(value)            (FLEX_US_MR_OOK_OVER_Msk & (_UINT32_(value) << FLEX_US_MR_OOK_OVER_Pos))
#define FLEX_US_MR_OOK_OOKRXD_Pos             _UINT32_(20)                                         /* (FLEX_US_MR) OOK Demodulation Input Selection Position */
#define FLEX_US_MR_OOK_OOKRXD_Msk             (_UINT32_(0x1) << FLEX_US_MR_OOK_OOKRXD_Pos)         /* (FLEX_US_MR) OOK Demodulation Input Selection Mask */
#define FLEX_US_MR_OOK_OOKRXD(value)          (FLEX_US_MR_OOK_OOKRXD_Msk & (_UINT32_(value) << FLEX_US_MR_OOK_OOKRXD_Pos))
#define FLEX_US_MR_OOK_OOKEN_Pos              _UINT32_(21)                                         /* (FLEX_US_MR) OOK Modulation/Demodulation Enabled Position */
#define FLEX_US_MR_OOK_OOKEN_Msk              (_UINT32_(0x1) << FLEX_US_MR_OOK_OOKEN_Pos)          /* (FLEX_US_MR) OOK Modulation/Demodulation Enabled Mask */
#define FLEX_US_MR_OOK_OOKEN(value)           (FLEX_US_MR_OOK_OOKEN_Msk & (_UINT32_(value) << FLEX_US_MR_OOK_OOKEN_Pos))
#define FLEX_US_MR_OOK_FILTER_Pos             _UINT32_(28)                                         /* (FLEX_US_MR) Receive Line Filter Position */
#define FLEX_US_MR_OOK_FILTER_Msk             (_UINT32_(0x1) << FLEX_US_MR_OOK_FILTER_Pos)         /* (FLEX_US_MR) Receive Line Filter Mask */
#define FLEX_US_MR_OOK_FILTER(value)          (FLEX_US_MR_OOK_FILTER_Msk & (_UINT32_(value) << FLEX_US_MR_OOK_FILTER_Pos))
#define FLEX_US_MR_OOK_Msk                    _UINT32_(0x103FFFFF)                                  /* (FLEX_US_MR_OOK) Register Mask  */


/* -------- FLEX_US_IER : (FLEXCOM Offset: 0x208) ( /W 32) USART Interrupt Enable Register -------- */
#define FLEX_US_IER_RXRDY_Pos                 _UINT32_(0)                                          /* (FLEX_US_IER) RXRDY Interrupt Enable Position */
#define FLEX_US_IER_RXRDY_Msk                 (_UINT32_(0x1) << FLEX_US_IER_RXRDY_Pos)             /* (FLEX_US_IER) RXRDY Interrupt Enable Mask */
#define FLEX_US_IER_RXRDY(value)              (FLEX_US_IER_RXRDY_Msk & (_UINT32_(value) << FLEX_US_IER_RXRDY_Pos)) /* Assigment of value for RXRDY in the FLEX_US_IER register */
#define FLEX_US_IER_TXRDY_Pos                 _UINT32_(1)                                          /* (FLEX_US_IER) TXRDY Interrupt Enable Position */
#define FLEX_US_IER_TXRDY_Msk                 (_UINT32_(0x1) << FLEX_US_IER_TXRDY_Pos)             /* (FLEX_US_IER) TXRDY Interrupt Enable Mask */
#define FLEX_US_IER_TXRDY(value)              (FLEX_US_IER_TXRDY_Msk & (_UINT32_(value) << FLEX_US_IER_TXRDY_Pos)) /* Assigment of value for TXRDY in the FLEX_US_IER register */
#define FLEX_US_IER_RXBRK_Pos                 _UINT32_(2)                                          /* (FLEX_US_IER) Receiver Break Interrupt Enable Position */
#define FLEX_US_IER_RXBRK_Msk                 (_UINT32_(0x1) << FLEX_US_IER_RXBRK_Pos)             /* (FLEX_US_IER) Receiver Break Interrupt Enable Mask */
#define FLEX_US_IER_RXBRK(value)              (FLEX_US_IER_RXBRK_Msk & (_UINT32_(value) << FLEX_US_IER_RXBRK_Pos)) /* Assigment of value for RXBRK in the FLEX_US_IER register */
#define FLEX_US_IER_ENDRX_Pos                 _UINT32_(3)                                          /* (FLEX_US_IER) End of Receive Transfer Interrupt Enable (available in all USART modes of operation) Position */
#define FLEX_US_IER_ENDRX_Msk                 (_UINT32_(0x1) << FLEX_US_IER_ENDRX_Pos)             /* (FLEX_US_IER) End of Receive Transfer Interrupt Enable (available in all USART modes of operation) Mask */
#define FLEX_US_IER_ENDRX(value)              (FLEX_US_IER_ENDRX_Msk & (_UINT32_(value) << FLEX_US_IER_ENDRX_Pos)) /* Assigment of value for ENDRX in the FLEX_US_IER register */
#define FLEX_US_IER_ENDTX_Pos                 _UINT32_(4)                                          /* (FLEX_US_IER) End of Transmit Interrupt Enable (available in all USART modes of operation) Position */
#define FLEX_US_IER_ENDTX_Msk                 (_UINT32_(0x1) << FLEX_US_IER_ENDTX_Pos)             /* (FLEX_US_IER) End of Transmit Interrupt Enable (available in all USART modes of operation) Mask */
#define FLEX_US_IER_ENDTX(value)              (FLEX_US_IER_ENDTX_Msk & (_UINT32_(value) << FLEX_US_IER_ENDTX_Pos)) /* Assigment of value for ENDTX in the FLEX_US_IER register */
#define FLEX_US_IER_OVRE_Pos                  _UINT32_(5)                                          /* (FLEX_US_IER) Overrun Error Interrupt Enable Position */
#define FLEX_US_IER_OVRE_Msk                  (_UINT32_(0x1) << FLEX_US_IER_OVRE_Pos)              /* (FLEX_US_IER) Overrun Error Interrupt Enable Mask */
#define FLEX_US_IER_OVRE(value)               (FLEX_US_IER_OVRE_Msk & (_UINT32_(value) << FLEX_US_IER_OVRE_Pos)) /* Assigment of value for OVRE in the FLEX_US_IER register */
#define FLEX_US_IER_FRAME_Pos                 _UINT32_(6)                                          /* (FLEX_US_IER) Framing Error Interrupt Enable Position */
#define FLEX_US_IER_FRAME_Msk                 (_UINT32_(0x1) << FLEX_US_IER_FRAME_Pos)             /* (FLEX_US_IER) Framing Error Interrupt Enable Mask */
#define FLEX_US_IER_FRAME(value)              (FLEX_US_IER_FRAME_Msk & (_UINT32_(value) << FLEX_US_IER_FRAME_Pos)) /* Assigment of value for FRAME in the FLEX_US_IER register */
#define FLEX_US_IER_PARE_Pos                  _UINT32_(7)                                          /* (FLEX_US_IER) Parity Error Interrupt Enable Position */
#define FLEX_US_IER_PARE_Msk                  (_UINT32_(0x1) << FLEX_US_IER_PARE_Pos)              /* (FLEX_US_IER) Parity Error Interrupt Enable Mask */
#define FLEX_US_IER_PARE(value)               (FLEX_US_IER_PARE_Msk & (_UINT32_(value) << FLEX_US_IER_PARE_Pos)) /* Assigment of value for PARE in the FLEX_US_IER register */
#define FLEX_US_IER_TIMEOUT_Pos               _UINT32_(8)                                          /* (FLEX_US_IER) Timeout Interrupt Enable Position */
#define FLEX_US_IER_TIMEOUT_Msk               (_UINT32_(0x1) << FLEX_US_IER_TIMEOUT_Pos)           /* (FLEX_US_IER) Timeout Interrupt Enable Mask */
#define FLEX_US_IER_TIMEOUT(value)            (FLEX_US_IER_TIMEOUT_Msk & (_UINT32_(value) << FLEX_US_IER_TIMEOUT_Pos)) /* Assigment of value for TIMEOUT in the FLEX_US_IER register */
#define FLEX_US_IER_TXEMPTY_Pos               _UINT32_(9)                                          /* (FLEX_US_IER) TXEMPTY Interrupt Enable Position */
#define FLEX_US_IER_TXEMPTY_Msk               (_UINT32_(0x1) << FLEX_US_IER_TXEMPTY_Pos)           /* (FLEX_US_IER) TXEMPTY Interrupt Enable Mask */
#define FLEX_US_IER_TXEMPTY(value)            (FLEX_US_IER_TXEMPTY_Msk & (_UINT32_(value) << FLEX_US_IER_TXEMPTY_Pos)) /* Assigment of value for TXEMPTY in the FLEX_US_IER register */
#define FLEX_US_IER_ITER_Pos                  _UINT32_(10)                                         /* (FLEX_US_IER) Max number of Repetitions Reached Interrupt Enable Position */
#define FLEX_US_IER_ITER_Msk                  (_UINT32_(0x1) << FLEX_US_IER_ITER_Pos)              /* (FLEX_US_IER) Max number of Repetitions Reached Interrupt Enable Mask */
#define FLEX_US_IER_ITER(value)               (FLEX_US_IER_ITER_Msk & (_UINT32_(value) << FLEX_US_IER_ITER_Pos)) /* Assigment of value for ITER in the FLEX_US_IER register */
#define FLEX_US_IER_TXBUFE_Pos                _UINT32_(11)                                         /* (FLEX_US_IER) Buffer Empty Interrupt Enable (available in all USART modes of operation) Position */
#define FLEX_US_IER_TXBUFE_Msk                (_UINT32_(0x1) << FLEX_US_IER_TXBUFE_Pos)            /* (FLEX_US_IER) Buffer Empty Interrupt Enable (available in all USART modes of operation) Mask */
#define FLEX_US_IER_TXBUFE(value)             (FLEX_US_IER_TXBUFE_Msk & (_UINT32_(value) << FLEX_US_IER_TXBUFE_Pos)) /* Assigment of value for TXBUFE in the FLEX_US_IER register */
#define FLEX_US_IER_RXBUFF_Pos                _UINT32_(12)                                         /* (FLEX_US_IER) Buffer Full Interrupt Enable (available in all USART modes of operation) Position */
#define FLEX_US_IER_RXBUFF_Msk                (_UINT32_(0x1) << FLEX_US_IER_RXBUFF_Pos)            /* (FLEX_US_IER) Buffer Full Interrupt Enable (available in all USART modes of operation) Mask */
#define FLEX_US_IER_RXBUFF(value)             (FLEX_US_IER_RXBUFF_Msk & (_UINT32_(value) << FLEX_US_IER_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the FLEX_US_IER register */
#define FLEX_US_IER_NACK_Pos                  _UINT32_(13)                                         /* (FLEX_US_IER) Non Acknowledge Interrupt Enable Position */
#define FLEX_US_IER_NACK_Msk                  (_UINT32_(0x1) << FLEX_US_IER_NACK_Pos)              /* (FLEX_US_IER) Non Acknowledge Interrupt Enable Mask */
#define FLEX_US_IER_NACK(value)               (FLEX_US_IER_NACK_Msk & (_UINT32_(value) << FLEX_US_IER_NACK_Pos)) /* Assigment of value for NACK in the FLEX_US_IER register */
#define FLEX_US_IER_CTSIC_Pos                 _UINT32_(19)                                         /* (FLEX_US_IER) Clear to Send Input Change Interrupt Enable Position */
#define FLEX_US_IER_CTSIC_Msk                 (_UINT32_(0x1) << FLEX_US_IER_CTSIC_Pos)             /* (FLEX_US_IER) Clear to Send Input Change Interrupt Enable Mask */
#define FLEX_US_IER_CTSIC(value)              (FLEX_US_IER_CTSIC_Msk & (_UINT32_(value) << FLEX_US_IER_CTSIC_Pos)) /* Assigment of value for CTSIC in the FLEX_US_IER register */
#define FLEX_US_IER_CMP_Pos                   _UINT32_(22)                                         /* (FLEX_US_IER) Comparison Interrupt Enable Position */
#define FLEX_US_IER_CMP_Msk                   (_UINT32_(0x1) << FLEX_US_IER_CMP_Pos)               /* (FLEX_US_IER) Comparison Interrupt Enable Mask */
#define FLEX_US_IER_CMP(value)                (FLEX_US_IER_CMP_Msk & (_UINT32_(value) << FLEX_US_IER_CMP_Pos)) /* Assigment of value for CMP in the FLEX_US_IER register */
#define FLEX_US_IER_MANE_Pos                  _UINT32_(24)                                         /* (FLEX_US_IER) Manchester Error Interrupt Enable Position */
#define FLEX_US_IER_MANE_Msk                  (_UINT32_(0x1) << FLEX_US_IER_MANE_Pos)              /* (FLEX_US_IER) Manchester Error Interrupt Enable Mask */
#define FLEX_US_IER_MANE(value)               (FLEX_US_IER_MANE_Msk & (_UINT32_(value) << FLEX_US_IER_MANE_Pos)) /* Assigment of value for MANE in the FLEX_US_IER register */
#define FLEX_US_IER_Msk                       _UINT32_(0x01483FFF)                                 /* (FLEX_US_IER) Register Mask  */

